OpenFOAM-v1712/tutorials/compressible/rhoPimpleDyMFoam/annularThermalMixer/system/surfaceFeatureExtractDictDefaults
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDictDefaults;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

extractionMethod    extractFromSurface;

includedAngle       150;  // Identifes a feature when angle
                          // between faces < includedAngle

trimFeatures
{
    minElem         10;   // minimum edges within a feature
}

writeObj            yes;  // writes out .obj files to view features

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
